sysbench/qzip/oltp_read_only.log
sysbench 1.1.0-faaff4f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 14975.76 qps: 239622.85 (r/w/o: 209669.73/0.00/29953.12) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 15215.31 qps: 243446.84 (r/w/o: 213016.33/0.00/30430.52) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 15273.42 qps: 244375.33 (r/w/o: 213828.49/0.00/30546.84) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 15124.60 qps: 241992.22 (r/w/o: 211743.12/0.00/30249.10) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 15075.22 qps: 241204.60 (r/w/o: 211054.06/0.00/30150.54) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 15287.30 qps: 244597.09 (r/w/o: 214022.40/0.00/30574.70) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 15187.86 qps: 243008.62 (r/w/o: 212632.90/0.00/30375.71) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 15294.84 qps: 244717.56 (r/w/o: 214127.88/0.00/30589.68) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 15233.73 qps: 243738.30 (r/w/o: 213270.84/0.00/30467.46) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 15179.01 qps: 242862.22 (r/w/o: 212504.29/0.00/30357.93) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 15359.42 qps: 245755.96 (r/w/o: 215036.83/0.00/30719.13) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 15172.96 qps: 242765.66 (r/w/o: 212419.94/0.00/30345.72) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 15039.80 qps: 240631.48 (r/w/o: 210551.87/0.00/30079.61) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 16 tps: 15108.69 qps: 241741.01 (r/w/o: 211523.73/0.00/30217.28) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 16 tps: 15136.16 qps: 242180.81 (r/w/o: 211908.40/0.00/30272.41) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 16 tps: 15261.25 qps: 244176.35 (r/w/o: 213653.96/0.00/30522.39) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 16 tps: 15245.22 qps: 243925.52 (r/w/o: 213434.98/0.00/30490.54) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 15249.68 qps: 243994.79 (r/w/o: 213495.63/0.00/30499.16) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 16 tps: 15210.36 qps: 243362.83 (r/w/o: 212941.90/0.00/30420.93) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 16 tps: 15224.83 qps: 243599.49 (r/w/o: 213149.83/0.00/30449.66) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 16 tps: 15172.73 qps: 242764.51 (r/w/o: 212419.34/0.00/30345.16) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 16 tps: 15007.24 qps: 240119.23 (r/w/o: 210104.45/0.00/30014.78) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 16 tps: 15212.63 qps: 243397.35 (r/w/o: 212972.09/0.00/30425.26) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 16 tps: 15106.10 qps: 241702.02 (r/w/o: 211489.81/0.00/30212.20) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 16 tps: 15105.17 qps: 241681.96 (r/w/o: 211471.62/0.00/30210.35) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 16 tps: 15243.37 qps: 243893.76 (r/w/o: 213407.02/0.00/30486.75) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 16 tps: 15236.38 qps: 243781.28 (r/w/o: 213308.52/0.00/30472.76) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 16 tps: 15453.72 qps: 247259.39 (r/w/o: 216352.05/0.00/30907.34) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 16 tps: 15247.90 qps: 243964.90 (r/w/o: 213469.00/0.00/30495.90) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 16 tps: 15113.49 qps: 241815.17 (r/w/o: 211588.30/0.00/30226.87) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 16 tps: 15142.53 qps: 242282.43 (r/w/o: 211997.27/0.00/30285.17) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 16 tps: 15273.23 qps: 244369.27 (r/w/o: 213822.81/0.00/30546.46) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 16 tps: 15121.81 qps: 241950.13 (r/w/o: 211706.52/0.00/30243.62) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 16 tps: 15278.99 qps: 244461.68 (r/w/o: 213903.81/0.00/30557.87) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 16 tps: 15103.87 qps: 241663.83 (r/w/o: 211455.99/0.00/30207.84) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 16 tps: 15158.02 qps: 242532.12 (r/w/o: 212216.08/0.00/30316.04) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 16 tps: 15200.44 qps: 243204.80 (r/w/o: 212804.02/0.00/30400.79) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 16 tps: 15116.25 qps: 241861.37 (r/w/o: 211628.76/0.00/30232.61) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 16 tps: 15279.13 qps: 244463.77 (r/w/o: 213905.61/0.00/30558.16) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 16 tps: 15259.49 qps: 244148.62 (r/w/o: 213629.55/0.00/30519.08) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 16 tps: 15132.62 qps: 242124.25 (r/w/o: 211859.00/0.00/30265.24) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 16 tps: 15123.90 qps: 241985.52 (r/w/o: 211737.72/0.00/30247.80) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 16 tps: 15104.01 qps: 241660.41 (r/w/o: 211452.40/0.00/30208.01) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 16 tps: 15315.04 qps: 245039.24 (r/w/o: 214409.26/0.00/30629.98) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 16 tps: 15210.83 qps: 243376.36 (r/w/o: 212954.59/0.00/30421.77) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 16 tps: 15318.95 qps: 245099.95 (r/w/o: 214462.15/0.00/30637.79) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 16 tps: 15140.38 qps: 242247.50 (r/w/o: 211966.64/0.00/30280.86) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 16 tps: 15181.80 qps: 242912.33 (r/w/o: 212548.74/0.00/30363.59) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 16 tps: 15136.05 qps: 242178.31 (r/w/o: 211906.21/0.00/30272.10) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 16 tps: 15346.86 qps: 245544.39 (r/w/o: 214850.78/0.00/30693.61) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 16 tps: 15208.77 qps: 243343.57 (r/w/o: 212926.04/0.00/30417.53) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 16 tps: 15304.40 qps: 244870.99 (r/w/o: 214262.09/0.00/30608.90) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 16 tps: 15197.41 qps: 243154.72 (r/w/o: 212760.11/0.00/30394.62) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 16 tps: 15241.70 qps: 243869.13 (r/w/o: 213385.63/0.00/30483.50) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 16 tps: 15221.24 qps: 243541.05 (r/w/o: 213098.57/0.00/30442.48) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 16 tps: 15019.44 qps: 240312.21 (r/w/o: 210273.34/0.00/30038.88) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 16 tps: 15292.21 qps: 244674.88 (r/w/o: 214090.36/0.00/30584.52) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 16 tps: 15128.45 qps: 242054.35 (r/w/o: 211797.46/0.00/30256.89) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 16 tps: 15205.56 qps: 243287.82 (r/w/o: 212876.71/0.00/30411.12) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 16 tps: 15170.81 qps: 242736.50 (r/w/o: 212394.87/0.00/30341.62) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 610s ] thds: 16 tps: 15079.41 qps: 241266.67 (r/w/o: 211108.05/0.00/30158.62) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 620s ] thds: 16 tps: 15162.73 qps: 242602.12 (r/w/o: 212276.55/0.00/30325.56) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 630s ] thds: 16 tps: 15198.36 qps: 243177.95 (r/w/o: 212781.13/0.00/30396.82) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 640s ] thds: 16 tps: 15219.67 qps: 243511.50 (r/w/o: 213072.16/0.00/30439.34) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 650s ] thds: 16 tps: 15194.00 qps: 243106.42 (r/w/o: 212718.42/0.00/30388.00) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 660s ] thds: 16 tps: 15251.91 qps: 244031.34 (r/w/o: 213527.62/0.00/30503.72) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 670s ] thds: 16 tps: 15326.11 qps: 245217.91 (r/w/o: 214565.60/0.00/30652.31) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 680s ] thds: 16 tps: 15230.28 qps: 243680.04 (r/w/o: 213219.57/0.00/30460.47) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 690s ] thds: 16 tps: 15051.03 qps: 240820.52 (r/w/o: 210718.35/0.00/30102.16) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 700s ] thds: 16 tps: 15207.61 qps: 243320.92 (r/w/o: 212905.79/0.00/30415.13) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 710s ] thds: 16 tps: 15282.26 qps: 244515.35 (r/w/o: 213950.73/0.00/30564.62) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 720s ] thds: 16 tps: 15153.62 qps: 242458.88 (r/w/o: 212151.63/0.00/30307.25) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 730s ] thds: 16 tps: 15027.19 qps: 240434.60 (r/w/o: 210380.22/0.00/30054.37) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 740s ] thds: 16 tps: 15152.04 qps: 242433.09 (r/w/o: 212128.92/0.00/30304.17) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 750s ] thds: 16 tps: 15167.68 qps: 242682.35 (r/w/o: 212347.09/0.00/30335.26) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 760s ] thds: 16 tps: 15118.92 qps: 241900.50 (r/w/o: 211662.75/0.00/30237.75) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 770s ] thds: 16 tps: 15240.46 qps: 243849.47 (r/w/o: 213368.45/0.00/30481.02) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 780s ] thds: 16 tps: 15203.38 qps: 243250.62 (r/w/o: 212844.17/0.00/30406.45) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 790s ] thds: 16 tps: 15157.58 qps: 242525.60 (r/w/o: 212210.13/0.00/30315.46) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 800s ] thds: 16 tps: 15099.91 qps: 241598.19 (r/w/o: 211398.28/0.00/30199.91) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 810s ] thds: 16 tps: 15219.16 qps: 243503.20 (r/w/o: 213064.99/0.00/30438.21) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 820s ] thds: 16 tps: 15227.49 qps: 243637.90 (r/w/o: 213183.01/0.00/30454.89) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 830s ] thds: 16 tps: 15094.44 qps: 241514.09 (r/w/o: 211325.11/0.00/30188.99) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 840s ] thds: 16 tps: 15102.34 qps: 241639.89 (r/w/o: 211435.22/0.00/30204.67) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 850s ] thds: 16 tps: 15044.69 qps: 240715.78 (r/w/o: 210626.40/0.00/30089.39) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 860s ] thds: 16 tps: 15188.16 qps: 243008.52 (r/w/o: 212632.39/0.00/30376.13) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 870s ] thds: 16 tps: 15155.73 qps: 242488.81 (r/w/o: 212177.15/0.00/30311.66) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 880s ] thds: 16 tps: 15185.50 qps: 242970.67 (r/w/o: 212599.68/0.00/30371.00) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 890s ] thds: 16 tps: 15188.39 qps: 243015.38 (r/w/o: 212638.61/0.00/30376.77) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 900s ] thds: 16 tps: 15232.94 qps: 243727.03 (r/w/o: 213261.15/0.00/30465.88) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 910s ] thds: 16 tps: 15155.86 qps: 242491.13 (r/w/o: 212179.52/0.00/30311.62) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 920s ] thds: 16 tps: 15243.21 qps: 243891.32 (r/w/o: 213404.89/0.00/30486.43) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 930s ] thds: 16 tps: 15232.02 qps: 243711.14 (r/w/o: 213247.09/0.00/30464.04) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 940s ] thds: 16 tps: 15069.96 qps: 241119.90 (r/w/o: 210979.89/0.00/30140.01) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 950s ] thds: 16 tps: 15046.43 qps: 240747.34 (r/w/o: 210654.58/0.00/30092.77) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 960s ] thds: 16 tps: 15127.94 qps: 242046.08 (r/w/o: 211790.09/0.00/30255.98) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 970s ] thds: 16 tps: 15217.04 qps: 243475.70 (r/w/o: 213041.62/0.00/30434.07) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 980s ] thds: 16 tps: 15187.90 qps: 243004.33 (r/w/o: 212628.54/0.00/30375.79) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 990s ] thds: 16 tps: 15130.84 qps: 242094.63 (r/w/o: 211832.95/0.00/30261.68) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1000s ] thds: 16 tps: 15201.25 qps: 243217.12 (r/w/o: 212814.61/0.00/30402.50) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1010s ] thds: 16 tps: 14875.36 qps: 238003.61 (r/w/o: 208253.00/0.00/29750.61) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 1020s ] thds: 16 tps: 14832.59 qps: 237322.97 (r/w/o: 207657.68/0.00/29665.28) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 1030s ] thds: 16 tps: 15205.96 qps: 243290.88 (r/w/o: 212878.97/0.00/30411.91) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1040s ] thds: 16 tps: 15138.56 qps: 242221.12 (r/w/o: 211943.99/0.00/30277.13) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1050s ] thds: 16 tps: 15262.67 qps: 244204.47 (r/w/o: 213679.14/0.00/30525.33) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1060s ] thds: 16 tps: 15185.33 qps: 242960.65 (r/w/o: 212589.98/0.00/30370.67) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1070s ] thds: 16 tps: 15300.61 qps: 244813.31 (r/w/o: 214212.08/0.00/30601.23) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1080s ] thds: 16 tps: 15139.61 qps: 242231.42 (r/w/o: 211952.21/0.00/30279.22) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1090s ] thds: 16 tps: 15234.68 qps: 243758.80 (r/w/o: 213289.34/0.00/30469.46) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1100s ] thds: 16 tps: 14880.38 qps: 238084.52 (r/w/o: 208323.87/0.00/29760.65) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 1110s ] thds: 16 tps: 15118.23 qps: 241891.32 (r/w/o: 211654.87/0.00/30236.45) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1120s ] thds: 16 tps: 15061.72 qps: 240987.32 (r/w/o: 210863.98/0.00/30123.34) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1130s ] thds: 16 tps: 15108.59 qps: 241737.08 (r/w/o: 211519.99/0.00/30217.08) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 1140s ] thds: 16 tps: 15118.59 qps: 241895.86 (r/w/o: 211658.47/0.00/30237.38) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1150s ] thds: 16 tps: 15105.95 qps: 241697.86 (r/w/o: 211485.96/0.00/30211.89) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1160s ] thds: 16 tps: 15211.51 qps: 243382.98 (r/w/o: 212960.06/0.00/30422.92) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1170s ] thds: 16 tps: 15338.36 qps: 245417.41 (r/w/o: 214740.60/0.00/30676.81) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 1180s ] thds: 16 tps: 15212.30 qps: 243395.73 (r/w/o: 212971.24/0.00/30424.49) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1190s ] thds: 16 tps: 15126.60 qps: 242024.67 (r/w/o: 211771.37/0.00/30253.31) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1200s ] thds: 16 tps: 15145.41 qps: 242325.72 (r/w/o: 212034.80/0.00/30290.91) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1210s ] thds: 16 tps: 14953.74 qps: 239260.68 (r/w/o: 209353.41/0.00/29907.27) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 1220s ] thds: 16 tps: 15211.42 qps: 243381.37 (r/w/o: 212958.43/0.00/30422.93) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1230s ] thds: 16 tps: 15113.66 qps: 241816.79 (r/w/o: 211589.48/0.00/30227.31) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1240s ] thds: 16 tps: 15155.34 qps: 242488.27 (r/w/o: 212177.60/0.00/30310.67) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1250s ] thds: 16 tps: 15131.43 qps: 242102.20 (r/w/o: 211839.34/0.00/30262.86) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1260s ] thds: 16 tps: 15282.04 qps: 244510.81 (r/w/o: 213946.73/0.00/30564.08) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 1270s ] thds: 16 tps: 15355.81 qps: 245695.23 (r/w/o: 214983.60/0.00/30711.63) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 1280s ] thds: 16 tps: 15201.71 qps: 243227.60 (r/w/o: 212824.27/0.00/30403.32) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 1290s ] thds: 16 tps: 15141.37 qps: 242259.49 (r/w/o: 211976.75/0.00/30282.74) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1300s ] thds: 16 tps: 15165.72 qps: 242653.92 (r/w/o: 212322.38/0.00/30331.54) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1310s ] thds: 16 tps: 15293.18 qps: 244688.74 (r/w/o: 214102.38/0.00/30586.35) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 1320s ] thds: 16 tps: 15102.52 qps: 241643.50 (r/w/o: 211438.45/0.00/30205.05) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1330s ] thds: 16 tps: 15167.85 qps: 242684.68 (r/w/o: 212348.97/0.00/30335.71) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1340s ] thds: 16 tps: 15309.67 qps: 244956.05 (r/w/o: 214336.70/0.00/30619.34) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 1350s ] thds: 16 tps: 15039.47 qps: 240629.27 (r/w/o: 210550.34/0.00/30078.93) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1360s ] thds: 16 tps: 15095.76 qps: 241530.31 (r/w/o: 211338.70/0.00/30191.61) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1370s ] thds: 16 tps: 15166.31 qps: 242661.84 (r/w/o: 212329.41/0.00/30332.43) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1380s ] thds: 16 tps: 15125.96 qps: 242014.32 (r/w/o: 211762.31/0.00/30252.02) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1390s ] thds: 16 tps: 15219.68 qps: 243515.16 (r/w/o: 213075.89/0.00/30439.27) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1400s ] thds: 16 tps: 15146.84 qps: 242349.28 (r/w/o: 212055.50/0.00/30293.77) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1410s ] thds: 16 tps: 15138.53 qps: 242219.72 (r/w/o: 211942.67/0.00/30277.05) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1420s ] thds: 16 tps: 15241.39 qps: 243860.31 (r/w/o: 213377.54/0.00/30482.78) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 1430s ] thds: 16 tps: 15239.46 qps: 243832.82 (r/w/o: 213354.00/0.00/30478.83) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1440s ] thds: 16 tps: 15135.39 qps: 242166.06 (r/w/o: 211895.19/0.00/30270.87) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 1450s ] thds: 16 tps: 15261.99 qps: 244194.18 (r/w/o: 213670.20/0.00/30523.97) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 1460s ] thds: 16 tps: 15190.95 qps: 243052.22 (r/w/o: 212670.32/0.00/30381.90) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1470s ] thds: 16 tps: 15271.63 qps: 244343.45 (r/w/o: 213800.39/0.00/30543.06) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1480s ] thds: 16 tps: 15236.53 qps: 243788.39 (r/w/o: 213315.13/0.00/30473.26) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1490s ] thds: 16 tps: 15144.03 qps: 242305.58 (r/w/o: 212017.52/0.00/30288.06) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1500s ] thds: 16 tps: 15233.10 qps: 243726.61 (r/w/o: 213260.40/0.00/30466.20) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1510s ] thds: 16 tps: 15294.16 qps: 244707.08 (r/w/o: 214118.76/0.00/30588.32) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 1520s ] thds: 16 tps: 15255.91 qps: 244095.64 (r/w/o: 213583.92/0.00/30511.72) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1530s ] thds: 16 tps: 15222.87 qps: 243564.00 (r/w/o: 213118.07/0.00/30445.94) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1540s ] thds: 16 tps: 15081.66 qps: 241309.13 (r/w/o: 211145.90/0.00/30163.23) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1550s ] thds: 16 tps: 15173.75 qps: 242779.34 (r/w/o: 212431.84/0.00/30347.51) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1560s ] thds: 16 tps: 15094.60 qps: 241513.21 (r/w/o: 211324.01/0.00/30189.20) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1570s ] thds: 16 tps: 14913.81 qps: 238617.46 (r/w/o: 208790.14/0.00/29827.32) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 1580s ] thds: 16 tps: 15042.77 qps: 240687.90 (r/w/o: 210602.05/0.00/30085.85) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 1590s ] thds: 16 tps: 15144.05 qps: 242301.87 (r/w/o: 212013.96/0.00/30287.91) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1600s ] thds: 16 tps: 15148.64 qps: 242380.77 (r/w/o: 212083.29/0.00/30297.48) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1610s ] thds: 16 tps: 15320.18 qps: 245122.74 (r/w/o: 214482.37/0.00/30640.37) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1620s ] thds: 16 tps: 15202.64 qps: 243243.09 (r/w/o: 212837.80/0.00/30405.29) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1630s ] thds: 16 tps: 15168.69 qps: 242701.38 (r/w/o: 212363.99/0.00/30337.38) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1640s ] thds: 16 tps: 15229.02 qps: 243661.62 (r/w/o: 213203.58/0.00/30458.04) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1650s ] thds: 16 tps: 15259.95 qps: 244157.25 (r/w/o: 213637.34/0.00/30519.91) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 1660s ] thds: 16 tps: 15223.74 qps: 243579.38 (r/w/o: 213132.01/0.00/30447.37) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1670s ] thds: 16 tps: 15084.13 qps: 241348.09 (r/w/o: 211179.73/0.00/30168.36) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1680s ] thds: 16 tps: 15208.51 qps: 243335.25 (r/w/o: 212918.34/0.00/30416.92) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1690s ] thds: 16 tps: 15167.04 qps: 242674.20 (r/w/o: 212340.02/0.00/30334.17) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1700s ] thds: 16 tps: 15242.44 qps: 243878.86 (r/w/o: 213393.99/0.00/30484.87) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1710s ] thds: 16 tps: 15286.60 qps: 244587.77 (r/w/o: 214014.57/0.00/30573.20) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1720s ] thds: 16 tps: 15308.07 qps: 244925.47 (r/w/o: 214309.34/0.00/30616.13) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1730s ] thds: 16 tps: 15166.72 qps: 242668.78 (r/w/o: 212335.44/0.00/30333.33) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1740s ] thds: 16 tps: 15168.54 qps: 242702.19 (r/w/o: 212365.02/0.00/30337.17) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1750s ] thds: 16 tps: 15124.33 qps: 241984.70 (r/w/o: 211736.04/0.00/30248.66) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1760s ] thds: 16 tps: 15250.08 qps: 244000.16 (r/w/o: 213500.00/0.00/30500.16) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1770s ] thds: 16 tps: 15287.33 qps: 244595.87 (r/w/o: 214021.31/0.00/30574.56) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 1780s ] thds: 16 tps: 15203.78 qps: 243263.25 (r/w/o: 212855.70/0.00/30407.56) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1790s ] thds: 16 tps: 15139.70 qps: 242230.44 (r/w/o: 211950.94/0.00/30279.49) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 1800s ] thds: 16 tps: 15118.96 qps: 241904.21 (r/w/o: 211666.88/0.00/30237.33) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            382490794
        write:                           0
        other:                           54641542
        total:                           437132336
    transactions:                        27320771 (15178.17 per sec.)
    queries:                             437132336 (242850.80 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      15178.1749
    time elapsed:                        1800.0037s
    total number of events:              27320771

Latency (ms):
         min:                                    0.80
         avg:                                    1.05
         max:                                   59.38
         95th percentile:                        1.23
         sum:                             28752417.25

Threads fairness:
    events (avg/stddev):           1707548.1875/11742.82
    execution time (avg/stddev):   1797.0261/0.02